
===========================================================================
report_tns
============================================================================
tns -11.54

===========================================================================
report_wns
============================================================================
wns -2.66

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.66

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.15
